/////////////////////////////////////////////////////////////////////////////
// Приемочный тест развертывания изменений в среде билд-сервера
//

Перем МенеджерСборки;
Перем КаталогТекущегоСкрипта;
Перем КаталогРабочихСкриптов;
Перем Интерпретатор;

Процедура ЗапуститьИПодождать(СтрокаПодключения)
	
	КодВозврата = -1;
	Лог = КаталогТекущегоСкрипта + "\log.txt";
	ЗапуститьПриложение("cmd.exe /C """ + СтрокаПодключения + """ > " + Лог,, Истина, КодВозврата);
	
	Чтение = Новый ЧтениеТекста(Лог, "cp866");
	Стр = Чтение.Прочитать();
	Чтение.Закрыть();
	Сообщить(Стр);
	Если КодВозврата <> 0 Тогда
		ВызватьИсключение "Команда вернула код возврата <"+КодВозврата+">";
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьТекущееХранилище(Знач ИсходныйФайлХранилища)

	ИсходныйФайл = КаталогТекущегоСкрипта + "\" + ИсходныйФайлХранилища;
	ЦелевойФайл = МенеджерСборки.Настройки().ПутьКХранилищу + "\1cv8ddb.1CD";
	
	Сообщить("Копирую хранилище <"+ИсходныйФайл+"> в расположение <"+ЦелевойФайл+">");
	
	КопироватьФайл(ИсходныйФайл, ЦелевойФайл); 

КонецПроцедуры

Процедура ОбновитьБазуИзХранилища()

	Сообщить("Выполняю команду: ОбновитьБазуИзХранилища");
	ЗапуститьИПодождать(Интерпретатор + " " + КаталогРабочихСкриптов + "\retrieve_storage.os");

КонецПроцедуры

Процедура ОбновитьКонфигурациюБазыДанных()

	Сообщить("Выполняю команду: ОбновитьКонфигурациюБазыДанных");
	ЗапуститьИПодождать(Интерпретатор + " " + КаталогРабочихСкриптов + "\update_dbconf.os");

КонецПроцедуры

Процедура ОбновитьБазуДанныхВРежимеПредприятия()
	
	Сообщить("Выполняю команду: ОбновитьБазуДанныхВРежимеПредприятия");
	ЗапуститьИПодождать(Интерпретатор + " " + КаталогРабочихСкриптов + "\update_enterprise.os");
	
КонецПроцедуры

Процедура ПроверитьВерсиюВМетаданных(Знач ТребуемаяВерсия)
	ВызватьИсключение "Не реализовано";
КонецПроцедуры

Процедура ПроверитьВерсиюВКонстантах(Знач ТребуемаяВерсия)
	ВызватьИсключение "Не реализовано";
КонецПроцедуры

Интерпретатор = """" + АргументыКоманднойСтроки[0] + """";
Сообщить("Интерпретатор: " + Интерпретатор);

ТекСкрипт = ТекущийСценарий().Источник;
КаталогТекущегоСкрипта = Новый Файл(ТекСкрипт).Путь;
КаталогРабочихСкриптов = Новый Файл(КаталогТекущегоСкрипта + "\..\Scripts").ПолноеИмя;

Сообщить("Каталог текущего скрипта:" + КаталогТекущегоСкрипта);
Сообщить("Каталог рабочих скриптов:" + КаталогРабочихСкриптов);

ПодключитьСценарий(КаталогРабочихСкриптов + "\build_main.os", "МенеджерСборки");
МенеджерСборки = Новый МенеджерСборки();

////////////////////////////////////////////////////////////////
// Сценарий теста 
//

УстановитьТекущееХранилище("storage_initial.1CD");
ОбновитьБазуИзХранилища();
ОбновитьКонфигурациюБазыДанных();
ПроверитьВерсиюВМетаданных("1.0.1.1");

УстановитьТекущееХранилище("storage_initial.1CD");
ОбновитьБазуИзХранилища();
ОбновитьКонфигурациюБазыДанных();
ОбновитьБазуДанныхВРежимеПредприятия();
ПроверитьВерсиюВМетаданных("1.0.1.2");
ПроверитьВерсиюВКонстантах("1.0.1.2");