/////////////////////////////////////////////////////////////////////////////
// Приемочный тест развертывания изменений в среде билд-сервера
//

Перем КаталогСборки;
Перем МенеджерСборки;
Перем КаталогТекущегоСкрипта;
Перем КаталогРабочихСкриптов;
Перем Интерпретатор;

Процедура УстановитьТекущееХранилище(Знач ИсходныйФайлХранилища)

	ИсходныйФайл = КаталогТекущегоСкрипта + "\" + ИсходныйФайлХранилища;
	КопироватьФайл(ИсходныйФайл, МенеджерСборки.Настройки().ПутьКХранилищу + "\1cv8ddb.1CD"); 

КонецПроцедуры

Процедура ОбновитьБазуИзХранилища()

	ЗапуститьПриложение(Интерпретатор + " " + КаталогРабочихСкриптов + "\retrieve_storage.os");

КонецПроцедуры

Процедура ОбновитьКонфигурациюБазыДанных()

	ЗапуститьПриложение(Интерпретатор + " " + КаталогРабочихСкриптов + "\update_dbconf.os");

КонецПроцедуры

Процедура ОбновитьБазуДанныхВРежимеПредприятия()
	
	ЗапуститьПриложение(Интерпретатор + " " + КаталогРабочихСкриптов + "\update_enterprise.os");
	
КонецПроцедуры

Процедура ПроверитьВерсиюВМетаданных(Знач ТребуемаяВерсия)
	ВызватьИсключение "Не реализовано";
КонецПроцедуры

Процедура ПроверитьВерсиюВКонстантах(Знач ТребуемаяВерсия)
	ВызватьИсключение "Не реализовано";
КонецПроцедуры

Интерпретатор = АргументыКоманднойСтроки[0];

ТекСкрипт = ТекущийСценарий().Источник;
КаталогТекущегоСкрипта = Новый Файл(ТекСкрипт).Путь;
КаталогРабочихСкриптов = Новый Файл(КаталогТекущегоСкрипта + "\..\Scripts").ПолноеИмя;

ПодключитьСценарий(КаталогРабочихСкриптов + "\build_main.os", "МенеджерСборки");
МенеджерСборки = Новый МенеджерСборки();

КаталогСборки = КаталогРабочихСкриптов + "\v8Temp";

УстановитьТекущееХранилище("storage_initial.1CD");
ОбновитьБазуИзХранилища();
ОбновитьКонфигурациюБазыДанных();
ПроверитьВерсиюВМетаданных("1.0.1.1");

УстановитьТекущееХранилище("storage_initial.1CD");
ОбновитьБазуИзХранилища();
ОбновитьКонфигурациюБазыДанных();
ОбновитьБазуДанныхВРежимеПредприятия();
ПроверитьВерсиюВМетаданных("1.0.1.2");
ПроверитьВерсиюВКонстантах("1.0.1.2");