/////////////////////////////////////////////////////////////////////////////
// Приемочный тест развертывания изменений в среде билд-сервера
//

Перем МенеджерСборки;
Перем КаталогТекущегоСкрипта;

Процедура ПроверитьВерсиюВМетаданных(Знач ТребуемаяВерсия)
	
	Настройки = МенеджерСборки.Настройки();
	app = Новый COMОбъект("V83.ComConnector");
	db = app.Connect("Srvr=""WS-MSK-A2981:2041"";Ref=""srv"";Usr="""+Настройки.АдминистраторБазы+""";Pwd="""+Настройки.ПарольАдминистратораБазы+""";");
	
	ВерсияБазы  = db.Метаданные.Версия;
	Сообщить("Метаданные базы: " + ВерсияБазы + ", Требуемая версия: " + ТребуемаяВерсия);
	
	ОсвободитьОбъект(db);
	ОсвободитьОбъект(app);
	
	Если ТребуемаяВерсия <> ВерсияБазы Тогда
		ВызватьИсключение "Версия не соответствует требуемой";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВерсиюВКонстантах(Знач ТребуемаяВерсия)
	
	Настройки = МенеджерСборки.Настройки();
	app = Новый COMОбъект("V83.ComConnector");
	db = app.Connect("Srvr=""WS-MSK-A2981:2041"";Ref=""srv"";Usr="""+Настройки.АдминистраторБазы+""";Pwd="""+Настройки.ПарольАдминистратораБазы+""";");
	
	ВерсияБазы = db.Константы.ВерсияСистемы.Получить();
	
	ОсвободитьОбъект(db);
	ОсвободитьОбъект(app);
	
	Сообщить("Версия в константе: " + ВерсияБазы + ", Требуемая версия: " + ТребуемаяВерсия);
	
	Если ТребуемаяВерсия <> ВерсияБазы Тогда
		ВызватьИсключение "Версия в константе ВерсияСистемы не соответствует требуемой";
	КонецЕсли;
	
КонецПроцедуры

ТекСкрипт = ТекущийСценарий().Источник;
КаталогТекущегоСкрипта = Новый Файл(ТекСкрипт).Путь;
КаталогРабочихСкриптов = Новый Файл(КаталогТекущегоСкрипта + "\..\Scripts").ПолноеИмя;

ПодключитьСценарий(КаталогРабочихСкриптов + "\build_main.os", "МенеджерСборки");
МенеджерСборки = Новый МенеджерСборки();

Если АргументыКоманднойСтроки.Количество() = 0 Тогда
	ВызватьИсключение "Не заданы аргументы командной строки";
КонецЕсли;

Если Лев(АргументыКоманднойСтроки[0], 1) = "-" Тогда
	// Это команда
	Если АргументыКоманднойСтроки.Количество() < 2 Тогда
		ВызватьИсключение "Не указана проверяемая версия";
	КонецЕсли;
	
	Команда = НРег(АргументыКоманднойСтроки[0]);
	Версия = АргументыКоманднойСтроки[1];
	
	Если Команда = "-metadata" Тогда
		ПроверитьВерсиюВМетаданных(Версия);
	ИначеЕсли Команда = "-database" Тогда
		ПроверитьВерсиюВКонстантах(Версия);
	КонецЕсли;
	
Иначе
	Версия = АргументыКоманднойСтроки[0];
	ПроверитьВерсиюВМетаданных(Версия);
	ПроверитьВерсиюВКонстантах(Версия);
КонецЕсли;